import type { Locale } from "../base";

const locale: Locale = {
  copy: {
    button: "コピー",
    error: "コピーできませんでした。",
    ok: "コピーしました！",
  },
  about: {
    text1: `メタリックシャウト。
            勉強や仕事を頑張っていれば、時々無性に叫びたくなるものです。けれども本当に叫べば周りに悪い意味で注目されてしまうでしょう。
            そんなとき、メタリックシャウトを使ってＳＮＳで叫べば、きっと楽しくなるはず。`,
    text2:
      "アスキーアートライクな修飾が施されたシャウトを投稿すれば、すぐさま貴方もインターネット通の仲間入りです。",
    text3:
      "メタリックシャウトの源は、金切り声という日本語にあります。言葉の意味としては危険を感じたときの叫び声ですが、別に危険じゃなくたって金切り声を叫んだっていいじゃないか！　そんな気持ちが込められています。",
    text4: `ため込んだ鬱憤を叫びに変えて、メタリックシャウトしましょう！
            貴方のＳＮＳへの投稿を楽しみにしています。`,
  },
};

export default locale;
